## [ DataFrame 인덱스 다루기 ]

- (1) 모듈 로딩 <hr>

In [1]:
import pandas as pd

- (2) 데이터 준비 <hr>

In [24]:
# dict 타입의 데이터 생성
exam = {'이름':['박희진','손예림','명노아','전진우']   
        ,'국어':[100,100,40,39]   
        ,'미술':[100,100,40,39]
        ,'수학':[92,88,79,58]
        ,'체육':[40,68,99,88]}

- (3) 데이터 저장<hr>

In [25]:
examDF = pd.DataFrame(exam)

- (4) 데이터 확인<hr>

In [20]:
examDF

    이름   국어   미술  수학  체육
0  박희진  100  100  92  40
1  손예림  100  100  88  68
2  명노아   40   40  79  99
3  전진우   39   39  58  88

- (5) 새로운 인덱스 설정 - 방법 1 : 인덱스 일부 변경 DF.rename()<hr>

In [5]:
# 행 인덱스 일부 변경 => index = {기존 인덱스 : 새로운 인덱스}
# inplace 매개변수/파라미터 => 웝본 DataFrame에 변경 여부 결정, 기본(False)은 월본 변경 안함!!
examDF.rename(index = {0:'zero'}, inplace=True)   # inplase : False ==> 반환값(복사본)을 줌

In [23]:
examDF

      국어   미술  수학  체육
이름
박희진  100  100  92  40
손예림  100  100  88  68
명노아   40   40  79  99
전진우   39   39  58  88

In [7]:
# 열 이름 인덱스 이룹 변경 ==> columns = {기존 인덱스 : 새로운 인덱스}
examDF.rename(columns={'체육':'음악'}, inplace=True)

- (5) 새로운 인덱스 설정 - 방법 2 : 특정 컬럼 => 인덱스 : DF.set_index() <hr>

In [8]:
# 현재 기본 0 ~ ==> 이름 컬럼을 인덱스로 설정
examDF.index

Index(['zero', 1, 2, 3], dtype='object')

In [9]:
# 1개 컬럼을 인덱스로 설정 단, inplace 파라미터가 False로 원본에 적용 X
# DataFrame.set_index(컬럼명)
examDF2 = examDF.set_index('이름')
examDF2.index

Index(['박희진', '손예림', '명노아', '전진우'], dtype='object', name='이름')

In [10]:
examDF2.loc['박희진']

국어    100
미술    100
수학     92
음악     40
Name: 박희진, dtype: int64

In [11]:
# 1개 컬럼을 인덱스로 설정 단, inplace 파라미터가 False로 원본에 적용 X
examDF3 = examDF.set_index(['이름','국어','미술'])   ## multi index - tuple로 묶어져 있음
examDF3.index           ## index의 레이블 인덱스는 컬럼명으로 설정

MultiIndex([('박희진', 100, 100),
            ('손예림', 100, 100),
            ('명노아',  40,  40),
            ('전진우',  39,  39)],
           names=['이름', '국어', '미술'])

In [13]:
examDF3.loc['박희진']    ## 모든 multi index명을 입력하지 않으면 나머지 인덱스랑 데이터가 출력
# examDF3.loc[(100,100)]   ## ==> Error / multi index에서 순서대로 값을 찾아나가기 때문에 / 100으로 시작하는 index 없음

         수학  음악
국어  미술
100 100  92  40

- (5) 새로운 인덱스 설정 - 방법 3 :

In [26]:
examDF.set_index('이름',inplace=True)
examDF

      국어   미술  수학  체육
이름
박희진  100  100  92  40
손예림  100  100  88  68
명노아   40   40  79  99
전진우   39   39  58  88

In [27]:
# 현재 행 인덱스 ==> 컬럼으로 추가
df1 = examDF.reset_index()
df1

    이름   국어   미술  수학  체육
0  박희진  100  100  92  40
1  손예림  100  100  88  68
2  명노아   40   40  79  99
3  전진우   39   39  58  88

In [29]:
examDF.reset_index().reset_index()  ## 가능

   index   이름   국어   미술  수학  체육
0      0  박희진  100  100  92  40
1      1  손예림  100  100  88  68
2      2  명노아   40   40  79  99
3      3  전진우   39   39  58  88

In [30]:
# 현재 행 인덱스를 삭제
df2 = examDF.reset_index(drop=True)    ## 행 인덱스 이름 삭제
df2

    국어   미술  수학  체육
0  100  100  92  40
1  100  100  88  68
2   40   40  79  99
3   39   39  58  88